Revit 2027 API
BuiltInFailures.RebarFailures.InvalidRebarHostNonStructural Property
 Rebar can't be placed in a non-structural element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidRebarHostNonStructural { get; }
Public Shared ReadOnly Property InvalidRebarHostNonStructural As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidRebarHostNonStructural {
	FailureDefinitionId^ get ();
}
static member InvalidRebarHostNonStructural : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarFailures Class
Autodesk.Revit.DB Namespace